app/views/profiles/index.html.erb

                          <p>
                            <% if user.profile.image.present?%>
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` IN (6, 9)