app/views/profiles/show.html.erb

        <div class="text-info text-center w-100">
          <h4><%= @profile.name || @profile.user.email.split('@').first.humanize %></h4>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9  ORDER BY `users`.`id` ASC LIMIT 1