app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('House', '2020-06-07 14:14:36', '2020-06-07 14:14:36')
---
  def create
    @category = Category.create(category_params)

DELETE FROM `categories` WHERE `categories`.`id` = 2
---
  def destroy
    @category.destroy

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
---
    def set_category
      @category = Category.find(params[:id])