app/controllers/products_controller.rb

  def show
    @bid_user = if @product.bid.buyer_id
        User.find(@product.bid.buyer_id)
---
SELECT  `bids`.* FROM `bids` WHERE `bids`.`product_id` = 4 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6  ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`category_id`, `name`, `price`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `description`, `last_bidding_date`, `user_id`, `created_at`, `updated_at`) VALUES (1, 'jhvd', 123123.0, '8f872a31d7eb775d9405fb007edef946.png', 'image/png', 189608, '2020-06-08 12:24:14', 'wewf', '2020-06-25 00:00:00', 6, '2020-06-08 12:24:15', '2020-06-08 12:24:15')

  def destroy
    @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 7

  def update_bid
    respond_to do |format|
      if valid_bid
        if @product.bid.update(product_bid_params)
---
UPDATE `bids` SET `current_bid` = 20000.0 WHERE `bids`.`id` = 2