app/controllers/profiles_controller.rb

  def index
    if params[:val].present?
      @users = User.includes(:profile).where(role: params[:val])
      @role = @users.first.role unless @users.empty?
---
SELECT  `users`.* FROM `users` WHERE `users`.`role` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` IN (6, 9)
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 6 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`role` = 2 LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `users` WHERE `users`.`role` = 1

  def rank
    user = User.find_by_id(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

  def set_profile
    @profile = Profile.find(params[:id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 6 LIMIT 1