app/controllers/welcome_controller.rb

  def index
    @products = Product.last(12).reverse
---
SELECT  `products`.* FROM `products`  ORDER BY `products`.`id` DESC LIMIT 12