app/views/categories/index.html.erb

SELECT COUNT(*) FROM `products` WHERE `products`.`category_id` = 1
---
        <div class="text-info text-center mt-2 w-100">
          <h1><%=category.products.size%></h1>