app/views/products/_form.html.erb

SELECT  `categories`.* FROM `categories`  ORDER BY `categories`.`name` ASC LIMIT 1
---
      <div class="col-sm-10 category-select">
        <%= f.collection_select :category_id, Category.order(:name),:id,:name, {prompt: "Select a category"}, required: true %>